src/03_language/01_logs/language_1_logs.org
#+TITLE: Language 1 Logs

#+BEGIN_EXPORT html
<pre>
<code> ./blog-1/03_language/01_logs/language_1_logs.html</code>
</pre>
#+END_EXPORT

[[https://hnvy.github.io/blog-1/][Home page]] - [[https://github.com/hnvy/blog-1/edit/main/src/03_language/01_logs/language_1_logs.org][ESotP]]

-----

* Introduction
:PROPERTIES:
:CUSTOM_ID: intro
:END:
See [[https://hnvy.github.io/about.html#language][this]].

* E#002 (29/05/2022) - numbers (J)
:PROPERTIES:
:CUSTOM_ID: org9abd369
:END:
I learned the numbers today.

- いち - 1
- に - 2
- さん - 3
- し/よん - 4
- ご - 5
- ろく - 6
- なな/しち - 7
- はち - 8
- く/きゅう - 9
- じゅう - 10

In order to say numbers such as 11, 12, 13, etc. you the number 10 first and then add a single digit number. Like so:
- じゅういち - 11
- じゅうに - 12

You can remember it this way: you take the number 10, and add to it. So, 10 (じゅう) + 1 (いち) = 11 (じゅういち). If you remember this one, then you can just do the opposite for the next part!

In order to say numbers such as 20, 30, 40, etc. you say a single digit number first, and then the number 10. Like so:
- にじゅう - 20
- さんじゅう - 30

* E#001 (16/05/2022) - scripts (J)
:PROPERTIES:
:CUSTOM_ID: orged88dfa
:END:
So, just to give you some background, I've already memorised the Hiragana and Katakana scripts (in 2019). But I wanted a refresher, so I went over them again this week!

Also, I already know that the Japanese language is made up of the three scripts: Hiragana, Katakana, and Kanji.

Hiragana and Katakana are the equivalent of letters. Kanji is a little more complex.

Hiragana:
1. あ - a
2. い - i
3. う - u
4. え - e
5. お - o
6. か - ka
7. き - ki
8. く - ku
9. け - ke
10. こ - ko
11. さ - sa
12. し - shi
13. す - su
14. せ - se
15. そ - so
16. た - ta
17. ち - chi
18. つ - tsu
19. て - te
20. と - to
21. な - na
22. に - ni
23. ぬ - nu
24. ね - ne
25. の - no
26. は - ha
27. ひ - hi
28. ふ - fu
29. へ - he
30. ほ - ho
31. ま - ma
32. み - mi
33. む - mu
34. め - me
35. も - mo
36. や - ya
37. ゆ - yu
38. よ - yo
39. ら - ra
40. り - ri
41. る - ru
42. れ - re
43. ろ - ro
44. わ - wa
45. を - wo
46. ん - nn

Katakana:
1. ア - a
2. イ - i
3. ウ - u
4. エ - e
5. オ - o
6. カ - ka
7. キ - ki
8. ク - ku
9. ケ - ke
10. コ - ko
11. サ - sa
12. シ - shi
13. ス - su
14. セ - se
15. ソ - so
16. タ - ta
17. チ - chi
18. ツ - tsu
19. テ - te
20. ト - to
21. ナ - na
22. ニ - ni
23. ヌ - nu
24. ネ - ne
25. ノ - no
26. ハ - ha
27. ヒ - hi
28. フ - fu
29. ヘ - he
30. ホ - ho
31. マ - ma
32. ミ - mi
33. ム - mu
34. メ - me
35. モ - mo
36. ヤ - ya
37. ユ - yu
38. ヨ - yo
39. ラ - ra
40. リ - ri
41. ル - ru
42. レ - re
43. ロ - ro
44. ワ - wa
45. ヲ - wo
46. ン - n
