03_language/01_logs/language_1_logs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Language 1 Logs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://hnvy.github.io/css/main.css" />
</head>
<body>
<div id="content" class="content">
<pre>
<code> ./blog-1/03_language/01_logs/language_1_logs.html</code>
</pre>

<p>
<p><a href="https://hnvy.github.io/blog-1/">Home page</a></p>
</p>

<p>
<p><a href="https://github.com/hnvy/blog-1/edit/main/src/03_language/01_logs/language_1_logs.org">ESotP</a></p>
</p>

<p>
<hr>
</p>

<div id="outline-container-intro" class="outline-2">
<h2 id="intro">Introduction</h2>
<div class="outline-text-2" id="text-intro">
<p>
See <a href="https://hnvy.github.io//about.html#language">this</a>.
</p>
</div>
</div>

<div id="outline-container-org9abd369" class="outline-2">
<h2 id="org9abd369">E#002 (29/05/2022) - numbers (J)</h2>
<div class="outline-text-2" id="text-org9abd369">
<p>
I learned the numbers today.
</p>

<ul class="org-ul">
<li>いち - 1</li>
<li>に - 2</li>
<li>さん - 3</li>
<li>し/よん - 4</li>
<li>ご - 5</li>
<li>ろく - 6</li>
<li>なな/しち - 7</li>
<li>はち - 8</li>
<li>く/きゅう - 9</li>
<li>じゅう - 10</li>
</ul>

<p>
In order to say numbers such as 11, 12, 13, etc. you the number 10 first and then add a single digit number. Like so:
</p>
<ul class="org-ul">
<li>じゅういち - 11</li>
<li>じゅうに - 12</li>
</ul>

<p>
You can remember it this way: you take the number 10, and add to it. So, 10 (じゅう) + 1 (いち) = 11 (じゅういち). If you remember this one, then you can just do the opposite for the next part!
</p>

<p>
In order to say numbers such as 20, 30, 40, etc. you say a single digit number first, and then the number 10. Like so:
</p>
<ul class="org-ul">
<li>にじゅう - 20</li>
<li>さんじゅう - 30</li>
</ul>
</div>
</div>

<div id="outline-container-orged88dfa" class="outline-2">
<h2 id="orged88dfa">E#001 (16/05/2022) - scripts (J)</h2>
<div class="outline-text-2" id="text-orged88dfa">
<p>
So, just to give you some background, I've already memorised the Hiragana and Katakana scripts (in 2019). But I wanted a refresher, so I went over them again this week!
</p>

<p>
Also, I already know that the Japanese language is made up of the three scripts: Hiragana, Katakana, and Kanji.
</p>

<p>
Hiragana and Katakana are the equivalent of letters. Kanji is a little more complex.
</p>

<p>
Hiragana:
</p>
<ol class="org-ol">
<li>あ - a</li>
<li>い - i</li>
<li>う - u</li>
<li>え - e</li>
<li>お - o</li>
<li>か - ka</li>
<li>き - ki</li>
<li>く - ku</li>
<li>け - ke</li>
<li>こ - ko</li>
<li>さ - sa</li>
<li>し - shi</li>
<li>す - su</li>
<li>せ - se</li>
<li>そ - so</li>
<li>た - ta</li>
<li>ち - chi</li>
<li>つ - tsu</li>
<li>て - te</li>
<li>と - to</li>
<li>な - na</li>
<li>に - ni</li>
<li>ぬ - nu</li>
<li>ね - ne</li>
<li>の - no</li>
<li>は - ha</li>
<li>ひ - hi</li>
<li>ふ - fu</li>
<li>へ - he</li>
<li>ほ - ho</li>
<li>ま - ma</li>
<li>み - mi</li>
<li>む - mu</li>
<li>め - me</li>
<li>も - mo</li>
<li>や - ya</li>
<li>ゆ - yu</li>
<li>よ - yo</li>
<li>ら - ra</li>
<li>り - ri</li>
<li>る - ru</li>
<li>れ - re</li>
<li>ろ - ro</li>
<li>わ - wa</li>
<li>を - wo</li>
<li>ん - nn</li>
</ol>

<p>
Katakana:
</p>
<ol class="org-ol">
<li>ア - a</li>
<li>イ - i</li>
<li>ウ - u</li>
<li>エ - e</li>
<li>オ - o</li>
<li>カ - ka</li>
<li>キ - ki</li>
<li>ク - ku</li>
<li>ケ - ke</li>
<li>コ - ko</li>
<li>サ - sa</li>
<li>シ - shi</li>
<li>ス - su</li>
<li>セ - se</li>
<li>ソ - so</li>
<li>タ - ta</li>
<li>チ - chi</li>
<li>ツ - tsu</li>
<li>テ - te</li>
<li>ト - to</li>
<li>ナ - na</li>
<li>ニ - ni</li>
<li>ヌ - nu</li>
<li>ネ - ne</li>
<li>ノ - no</li>
<li>ハ - ha</li>
<li>ヒ - hi</li>
<li>フ - fu</li>
<li>ヘ - he</li>
<li>ホ - ho</li>
<li>マ - ma</li>
<li>ミ - mi</li>
<li>ム - mu</li>
<li>メ - me</li>
<li>モ - mo</li>
<li>ヤ - ya</li>
<li>ユ - yu</li>
<li>ヨ - yo</li>
<li>ラ - ra</li>
<li>リ - ri</li>
<li>ル - ru</li>
<li>レ - re</li>
<li>ロ - ro</li>
<li>ワ - wa</li>
<li>ヲ - wo</li>
<li>ン - n</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
